# Создайте два множества, одно из которых содержит номера студентов,
# а другое — номера студентов, сдавших экзамен.
# Выведите всех студентов, которые не сдали экзамен.
# Найдите студентов, которые сдали экзамен (пересечение двух множеств).
# Объедините оба множества, чтобы получить список всех студентов 
# (в том числе и тех, кто сдал, и тех, кто не сдал экзамен).

students = {1, 2, 3, 4, 5, 6}
passed_exam = {3, 4, 5}

failed_exam = students - passed_exam
print("Студенты, не сдавшие экзамен:", failed_exam)  # Выведет: {1, 2, 6}

passed_exam_students = students & passed_exam
print("Студенты, сдавшие экзамен:", passed_exam_students)  # Выведет: {3, 4, 5}
